In [3]:
# 3.11 Deleting a Column
import pandas as pd
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

# delete column
dataframe.drop('Age' , axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [4]:
# delete columns
dataframe.drop(['Age','Sex'] , axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [8]:
# delete unnamed column using index
dataframe.drop(dataframe.columns[1],axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

In [9]:
# create a new dataframe
dataframe_name_dropped = dataframe.drop(dataframe.columns[0], axis=1)
dataframe_name_dropped.head(2)

  PClass   Age     Sex  Survived  SexCode
0    1st  29.0  female         1        1
1    1st   2.0  female         0        1

In [10]:
# 3.12 Deleting a Row

url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'
dataframe = pd.read_csv(url)

dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [12]:
# delete rows using a boolean condition, show first three rows 

dataframe[dataframe['Sex'] !='male'].head(3)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [15]:
# delete rows , use drop
dataframe.drop([0,1],axis=0).head(5)

# line below for axis 1 has error
# dataframe.drop([0,1],axis=1).head(5)

,Name,PClass,Age,Sex,Survived,SexCode
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1,1

In [16]:
dataframe[dataframe['Name'] != 'Allison, Miss Helen Loraine'].head(4)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [23]:
# delete row using index
dataframe[dataframe.index != 0].head(3)

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [29]:
# 3.13 Dropping Duplicate Rows

url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'
dataframe = pd.read_csv(url)

# delete duplicates
dataframe.drop_duplicates().head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [31]:
# show number of rows
print("Number Of Rows In The Original DataFrame:", len(dataframe))
print("Number Of Rows After Deduping:" , len(dataframe.drop_duplicates()))

Number Of Rows In The Original DataFrame: 1313
Number Of Rows After Deduping: 1313

In [34]:
# drop duplicates , just print first male and first female
dataframe.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [36]:
# just print last female and male
dataframe.drop_duplicates(subset='Sex' , keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [37]:
# return a boolean to show whether the row is duplicated or not
dataframe.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Length: 1313, dtype: bool

In [40]:
# 3.14 Grouping Rows by Values
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'
dataframe = pd.read_csv(url)

# Group rows by the values of the column 'Sex', calculate mean # of each group
dataframe.groupby('Sex').mean(numeric_only=True)

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [42]:
# grouped by needs to be paired with another operation that we 
# want to apply to each group
dataframe.groupby('Sex')

In [47]:
# Group rows, count rows
print(dataframe.groupby('Survived').count())
print("------------------------------------")
# count the number of names after grouping
dataframe.groupby('Survived')['Name'].count()

          Name  PClass  Age  Sex  SexCode
Survived
0          863     863  443  863      863
1          450     450  313  450      450
------------------------------------

Survived
0    863
1    450
Name: Name, dtype: int64

In [50]:
# Group rows, calculate mean
# grouping by sex and survive and then mean by age
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

In [56]:
# 3.15 Grouping Rows by Time
import numpy as np

# create a date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

# create dataframe
dataframe = pd.DataFrame(index=time_index)

# create column of random values
dataframe['sale_amount'] = np.random.randint(1,10,100000)

# Group rows by week, calculate sum per week
dataframe.resample('W').sum()

/tmp/ipykernel_16432/1542308236.py:5: FutureWarning: 'S' is deprecated and will be removed in a future version, please use 's' instead.
  time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

            sale_amount
2017-06-11        86150
2017-06-18       100306
2017-06-25       101188
2017-07-02       101520
2017-07-09       100894
2017-07-16        10565

In [57]:
dataframe.head(3)

                     sale_amount
2017-06-06 00:00:00            7
2017-06-06 00:00:30            6
2017-06-06 00:01:00            2

In [ ]:
# grouped by 2 weeks , and mean
dataframe.resample('2W').mean()

            sale_amount
2017-06-11     4.985532
2017-06-25     4.997371
2017-07-09     5.020188
2017-07-23     5.079327

In [ ]:
# group by month and then count
dataframe.resample('M').count()

/tmp/ipykernel_16432/3305436376.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dataframe.resample('M').count()

            sale_amount
2017-06-30        72000
2017-07-31        28000

In [61]:
# Group by month, count rows
# resample default is label = right so we can control this behavior
dataframe.resample('M' , label='left').count()

/tmp/ipykernel_16432/270233688.py:3: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dataframe.resample('M' , label='left').count()

            sale_amount
2017-05-31        72000
2017-06-30        28000

In [64]:
# 3.16 Aggregating Operations and Statistics
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

# get the min of every column
dataframe.agg('min')

Name        Abbing, Mr Anthony
PClass                       *
Age                       0.17
Sex                     female
Survived                     0
SexCode                      0
dtype: object

In [68]:
# mean of age and min, max of sexcode
dataframe.agg({'Age' :"mean" , 'SexCode':['min','max']})

            Age  SexCode
mean  30.397989      NaN
min         NaN      0.0
max         NaN      1.0

In [74]:
# Number of people who survived and didn't survive in each class
dataframe.groupby(['PClass', 'Survived']).agg({'Survived' : ['count']}).reset_index()

  PClass Survived
                  count
0      *        0     1
1    1st        0   129
2    1st        1   193
3    2nd        0   160
4    2nd        1   119
5    3rd        0   573
6    3rd        1   138

In [77]:
# i can write above code like this 
dataframe.groupby(['PClass', 'Survived'])['Survived'].count().reset_index

<bound method Series.reset_index of PClass  Survived
*       0             1
1st     0           129
        1           193
2nd     0           160
        1           119
3rd     0           573
        1           138
Name: Survived, dtype: int64>

In [82]:
# 3.17 Looping over a Column
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

# print first two names uppercase
for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [85]:
# show first four names uppercase
[name.upper() for name in dataframe['Name'][0:4]]

['ALLEN, MISS ELISABETH WALTON',
 'ALLISON, MISS HELEN LORAINE',
 'ALLISON, MR HUDSON JOSHUA CREIGHTON',
 'ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)']

In [ ]:
# 3.18 Applying a Function over All Elements in a Column

url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

def uppercase(x):
    return x.upper()

# apply a function on columns
dataframe['Name'].apply(uppercase)[0:3]

0           ALLEN, MISS ELISABETH WALTON
1            ALLISON, MISS HELEN LORAINE
2    ALLISON, MR HUDSON JOSHUA CREIGHTON
Name: Name, dtype: object

In [89]:
# 3.19 Applying a Function to Groups
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

dataframe.groupby('Sex').apply(lambda x:x.count())

/tmp/ipykernel_16432/3935200264.py:6: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  dataframe.groupby('Sex').apply(lambda x:x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

In [101]:
# 3.20 Concatenating DataFrames
# create a dictionary then a dataframe
data_a = {'id': ['1', '2', '3'],
         'first': ['Alex', 'Amy', 'Allen'],
        'last': ['Anderson', 'Ackerman', 'Ali']}

dataframe_a = pd.DataFrame(data_a , columns=['id' , 'first' , 'last'])
print(dataframe_a)

data_b = {'id': ['4', '5', '6'],
            'first': ['Billy', 'Brian', 'Bran'],
            'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b)
print('\n' ,dataframe_b)

# Concatenate DataFrames by rows
pd.concat([dataframe_a,dataframe_b] , axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali

   id  first     last
0  4  Billy   Bonder
1  5  Brian    Black
2  6   Bran  Balwner

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [104]:
# # Concatenate DataFrames by columns
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [ ]:
# 3.21 Merging DataFrames

# Create DataFrame
employee_data = {'employee_id': ['1', '2', '3', '4'],
                'name': ['Amy Jones', 'Allen Keys', 'Alice Bees','Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id',
'name'])
# Create DataFrame
sales_data = {'employee_id': ['3', '4', '5', '6'],
             'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data)
 
# merge dataframes
pd.merge(dataframe_employees,dataframe_sales , on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [110]:
pd.merge(dataframe_employees,dataframe_sales)

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [111]:
# Merge DataFrames
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [112]:
# specify left and right joins
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [113]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='right')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512
2           5         NaN         2345
3           6         NaN         1455

In [114]:
pd.merge(dataframe_employees,dataframe_sales,left_on='employee_id',
right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512